BrandworksBGIC/ipc_camera/chip/rts3917/sdk/rts39xx_sdk_v5.3/platform/source/drivers/wifi/rtl8723cu/hal/rtl8703b/usb/usb_halinit.c
			ps_state = ps_state & 0xC1;
			/* RTW_INFO("##### Change RPWM value to = %x for switch clk #####\n",ps_state); */
			rtw_write8(Adapter, REG_USB_HRPWM, ps_state);
		}
#endif /* CONFIG_LPS_LCLK */
		break;

	case HW_VAR_TRIGGER_GPIO_0:
		rtl8703bu_trigger_gpio_0(Adapter);
		break;

	default:
		ret = SetHwReg8703B(Adapter, variable, val);
		break;
	}

	return ret;
}

/*
 * If variable not handled here,
 * some variables will be processed in GetHwReg8703A()
 */
void GetHwReg8703BU(PADAPTER Adapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(Adapter);


	switch (variable) {
#ifdef CONFIG_LPS_LCLK
	case HW_VAR_CPWM:
		*val = rtw_read8(Adapter, REG_USB_HCPWM);
		break;
	case HW_VAR_RPWM_TOG:
		*val = rtw_read8(Adapter, REG_USB_HRPWM) & PS_TOGGLE;
		break;
#endif /* CONFIG_LPS_LCLK */
	default:
		GetHwReg8703B(Adapter, variable, val);
		break;
	}

}

/*
 * Description:
 * Query setting of specified variable.
 */
u8
GetHalDefVar8703BUsb(
		PADAPTER				Adapter,
		HAL_DEF_VARIABLE		eVariable,
		void						*pValue
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	case HAL_DEF_IS_SUPPORT_ANT_DIV:
#ifdef CONFIG_ANTENNA_DIVERSITY
		*((u8 *)pValue) = _FALSE;
#endif
		break;

	case HAL_DEF_DRVINFO_SZ:
		*((u32 *)pValue) = DRVINFO_SZ;
		break;
	case HAL_DEF_MAX_RECVBUF_SZ:
		*((u32 *)pValue) = MAX_RECVBUF_SZ;
		break;
	case HAL_DEF_RX_PACKET_OFFSET:
		*((u32 *)pValue) = RXDESC_SIZE + DRVINFO_SZ * 8;
		break;
	case HW_VAR_MAX_RX_AMPDU_FACTOR:
		*((HT_CAP_AMPDU_FACTOR *)pValue) = MAX_AMPDU_FACTOR_64K;
		break;
	default:
		bResult = GetHalDefVar8703B(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}




/*
 * Description:
 * Change default setting of specified variable.
 */
u8
SetHalDefVar8703BUsb(
		PADAPTER				Adapter,
		HAL_DEF_VARIABLE		eVariable,
		void						*pValue
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	default:
		bResult = SetHalDefVar8703B(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

static u8 rtl8703bu_ps_func(PADAPTER Adapter, HAL_INTF_PS_FUNC efunc_id, u8 *val)
{
	u8 bResult = _TRUE;

	switch (efunc_id) {

	default:
		break;
	}
	return bResult;
}

void rtl8703bu_set_hal_ops(_adapter *padapter)
{
	struct hal_ops	*pHalFunc = &padapter->hal_func;


	rtl8703b_set_hal_ops(pHalFunc);

	pHalFunc->hal_power_on = &_InitPowerOn_8703BU;
	pHalFunc->hal_power_off = &CardDisableRTL8703BU;

	pHalFunc->hal_init = &rtl8703bu_hal_init;
	pHalFunc->hal_deinit = &rtl8703bu_hal_deinit;

	pHalFunc->inirp_init = &rtl8703bu_inirp_init;
	pHalFunc->inirp_deinit = &rtl8703bu_inirp_deinit;

	pHalFunc->init_xmit_priv = &rtl8703bu_init_xmit_priv;
	pHalFunc->free_xmit_priv = &rtl8703bu_free_xmit_priv;

	pHalFunc->init_recv_priv = &rtl8703bu_init_recv_priv;
	pHalFunc->free_recv_priv = &rtl8703bu_free_recv_priv;
#ifdef CONFIG_RTW_SW_LED
	pHalFunc->InitSwLeds = &rtl8703bu_InitSwLeds;
	pHalFunc->DeInitSwLeds = &rtl8703bu_DeInitSwLeds;
#endif/*CONFIG_RTW_SW_LED */

	pHalFunc->init_default_value = &rtl8703b_init_default_value;
	pHalFunc->intf_chip_configure = &rtl8703bu_interface_configure;
	pHalFunc->read_adapter_info = &ReadAdapterInfo8703BU;

	pHalFunc->set_hw_reg_handler = &SetHwReg8703BU;
	pHalFunc->GetHwRegHandler = &GetHwReg8703BU;
	pHalFunc->get_hal_def_var_handler = &GetHalDefVar8703BUsb;
	pHalFunc->SetHalDefVarHandler = &SetHalDefVar8703BUsb;

	pHalFunc->hal_xmit = &rtl8703bu_hal_xmit;
	pHalFunc->mgnt_xmit = &rtl8703bu_mgnt_xmit;
#ifdef CONFIG_RTW_MGMT_QUEUE
	pHalFunc->hal_mgmt_xmitframe_enqueue = &rtl8703bu_hal_mgmt_xmitframe_enqueue;
#endif
	pHalFunc->hal_xmitframe_enqueue = &rtl8703bu_hal_xmitframe_enqueue;

#ifdef CONFIG_HOSTAPD_MLME
	pHalFunc->hostap_mgnt_xmit_entry = &rtl8703bu_hostap_mgnt_xmit_entry;
#endif
	pHalFunc->interface_ps_func = &rtl8703bu_ps_func;

#ifdef CONFIG_XMIT_THREAD_MODE
	pHalFunc->xmit_thread_handler = &rtl8703bu_xmit_buf_handler;
#endif
#ifdef CONFIG_SUPPORT_USB_INT
	pHalFunc->interrupt_handler = interrupt_handler_8703bu;
#endif

}
